Revit 2027 API
ExtendedPropertiesBindings.BindingType Property
 Indicates type vs instance bindings. Defaults to Instance.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExtendedPropertiesBindingType BindingType { get; set; }
Public Property BindingType As ExtendedPropertiesBindingType
	Get
	Set
public:
property ExtendedPropertiesBindingType BindingType {
	ExtendedPropertiesBindingType get ();
	void set (ExtendedPropertiesBindingType value);
}
member BindingType : ExtendedPropertiesBindingType with get, set
Property Value
ExtendedPropertiesBindingType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ExtendedPropertiesBindings Class
Autodesk.Revit.DB.ExternalData Namespace